STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_HeartRateThreadX/Core/Src/app_entry.c
  /* Setup GPIOB 3, 4 in Analog no pull */
  if(__HAL_RCC_GPIOB_IS_CLK_ENABLED() == 0)
  {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    GPIOB->PUPDR &= ~0x3C0;
    GPIOB->MODER |= 0x3C0;
    __HAL_RCC_GPIOB_CLK_DISABLE();
  }
  else
  {
    GPIOB->PUPDR &= ~0x3C0;
    GPIOB->MODER |= 0x3C0;
  }
#endif /* CFG_DEBUGGER_LEVEL */

#if (CFG_LPM_LEVEL != 0)
  /* Initialize low Power Manager. By default enabled */
  UTIL_LPM_Init();

#if ((CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1))
  /* Enable SRAM1, SRAM2 and RADIO retention*/
  LL_PWR_SetSRAM1SBRetention(LL_PWR_SRAM1_SB_FULL_RETENTION);
  LL_PWR_SetSRAM2SBRetention(LL_PWR_SRAM2_SB_FULL_RETENTION);
  LL_PWR_SetRadioSBRetention(LL_PWR_RADIO_SB_FULL_RETENTION); /* Retain sleep timer configuration */

#else /* (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1) */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_APP, UTIL_LPM_MAX_MODE);
#endif /* (CFG_LPM_STANDBY_SUPPORTED == 1) || (CFG_LPM_STOP2_SUPPORTED == 1) */

  UINT TXstatus = tx_byte_allocate(pBytePool, (void **)&pStack, TASK_STACK_SIZE_IDLE, TX_NO_WAIT);

  if( TXstatus == TX_SUCCESS )
  {
    TXstatus = tx_thread_create(&IdleTaskHandle, "IDLE Task", IDLE_Task_Entry, 0,
                                 pStack, TASK_STACK_SIZE_IDLE,
                                 TASK_PRIO_IDLE, TASK_PREEMP_IDLE,
                                 TX_NO_TIME_SLICE, TX_AUTO_START);
  }

  if( TXstatus != TX_SUCCESS )
  {
    LOG_ERROR_APP( "IDLE ThreadX objects creation FAILED, status: %d", TXstatus);
    Error_Handler();
  }

#endif /* (CFG_LPM_LEVEL != 0)  */

  /* USER CODE BEGIN SystemPower_Config */
  /* USER CODE END SystemPower_Config */
}

static void Wpan_Task_Entry(ULONG lArgument)
{
  UNUSED(lArgument);
  /* USER CODE BEGIN Wpan_Task_Entry_0 */

  /* USER CODE END Wpan_Task_Entry_0 */

  ULONG actual_flags;

  for(;;)
  {
    tx_event_flags_get( &WpanEventFlag, UINT32_MAX,
                        TX_OR_CLEAR, &actual_flags, TX_WAIT_FOREVER);

    if( actual_flags & (1U << CFG_RTOS_FLAG_RNG) )
    {
      HW_RNG_Process();
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_PKA) )
    {
      PKACTRL_BG_Process();
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_FlashManager) )
    {
      FM_BackgroundProcess();
    }

    /* Link Layer related */
    if( actual_flags & (1U << CFG_RTOS_FLAG_LinkLayer) )
    {
      tx_mutex_get(&LinkLayerMutex, TX_WAIT_FOREVER);
      ll_sys_bg_process();
      tx_mutex_put(&LinkLayerMutex);
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_TempRadioCalib) )
    {
      TEMPMEAS_RequestTemperatureMeasurement();
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_AMM) )
    {
      AMM_BackgroundProcess();
    }

    /* BLE related */
    if( actual_flags & (1U << CFG_RTOS_FLAG_BLEhost) )
    {
      BleStack_Process_BG();
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_BLEhciEvt) )
    {
      Ble_UserEvtRx();
    }

    if( actual_flags & (1U << CFG_RTOS_FLAG_BLEtimer) )
    {
      BLE_TIMER_Background();
    }
  }
}

/**
 * @brief Initialize Random Number Generator module
 */
static void APPE_RNG_Init(void)
{
}

/**
 * @brief Initialize Flash Manager module
 */
static void APPE_FLASH_MANAGER_Init(void)
{
  /* Init the Flash Manager module */
  FM_Init();

  /* Disable flash before any use - RFTS */
  FD_SetStatus (FD_FLASHACCESS_RFTS, LL_FLASH_DISABLE);
  /* Enable RFTS Bypass for flash operation - Since LL has not started yet */
  FD_SetStatus (FD_FLASHACCESS_RFTS_BYPASS, LL_FLASH_ENABLE);
  /* Enable flash system flag */
  FD_SetStatus (FD_FLASHACCESS_SYSTEM, LL_FLASH_ENABLE);

  return;
}

/**
 * @brief Initialize Public Key Accelerator module
 */
static void APPE_PKACTRL_Init(void)
{
}

static void APPE_AMM_Init(void)
{
  /* Initialize the Advance Memory Manager */
  if( AMM_Init(&ammInitConfig) != AMM_ERROR_OK )
  {
    Error_Handler();
  }

}

#if (CFG_LPM_LEVEL != 0)
static void IDLE_Task_Entry(ULONG lArgument)
{
  UNUSED(lArgument);
  /* USER CODE BEGIN IDLE_Task_Entry_0 */

  /* USER CODE END IDLE_Task_Entry_0 */

  while(1)
  {
    /* When no other activities to be done we decide to go in low power
       This mechanism is in charge to mange low power at application level
       without the support of ThreadX low power framework */
    UTILS_ENTER_CRITICAL_SECTION();
    ThreadXLowPowerUserEnter();
    ThreadXLowPowerUserExit();
    UTILS_EXIT_CRITICAL_SECTION();
    tx_thread_relinquish();
  }
}

/* return current time since boot, continue to count in standby low power mode */
static uint32_t getCurrentTime(void)
{
  return TIMER_IF_GetTimerValue();
}
#endif

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void PKACTRL_CB_Process( void )
{
  tx_event_flags_set(&WpanEventFlag, 1U << CFG_RTOS_FLAG_PKA, TX_OR);
}

/**
 * @brief Callback used by Random Number Generator to launch Task to generate Random Numbers
 */
void HWCB_RNG_Process( void )
{
  tx_event_flags_set(&WpanEventFlag, 1U << CFG_RTOS_FLAG_RNG, TX_OR);
}

void AMM_RegisterBasicMemoryManager (AMM_BasicMemoryManagerFunctions_t * const p_BasicMemoryManagerFunctions)
{
  /* Fulfill the function handle */
  p_BasicMemoryManagerFunctions->Init = AMM_WrapperInit;
  p_BasicMemoryManagerFunctions->Allocate = AMM_WrapperAllocate;
  p_BasicMemoryManagerFunctions->Free = AMM_WrapperFree;
}

void AMM_ProcessRequest(void)
{
  /* Trigger to call Advance Memory Manager process function */
  tx_event_flags_set(&WpanEventFlag, 1U << CFG_RTOS_FLAG_AMM, TX_OR);
}

static void AMM_WrapperInit(uint32_t * const p_PoolAddr, const uint32_t PoolSize)
{
  UTIL_MM_Init ((uint8_t *)p_PoolAddr, ((size_t)PoolSize * sizeof(uint32_t)));
}

static uint32_t * AMM_WrapperAllocate(const uint32_t BufferSize)
{
  return (uint32_t *)UTIL_MM_GetBuffer (((size_t)BufferSize * sizeof(uint32_t)));
}

static void AMM_WrapperFree (uint32_t * const p_BufferAddr)
{
  UTIL_MM_ReleaseBuffer ((void *)p_BufferAddr);
}

void FM_ProcessRequest(void)
{
  /* Trigger to call Flash Manager process function */
  tx_event_flags_set(&WpanEventFlag, 1U << CFG_RTOS_FLAG_FlashManager, TX_OR);
}

