STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_HeartRateThreadX/Core/Src/app_entry.c
  /* USER CODE END CRCCTRL_MutexRelease_1 */
  return crc_status;
}

#if (USE_TEMPERATURE_BASED_RADIO_CALIBRATION == 1)
ADCCTRL_Cmd_Status_t ADCCTRL_MutexTake(void)
{
  UINT TXstatus;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexTake_0 */

  /* USER CODE END ADCCTRL_MutexTake_0 */
  if(TX_THREAD_GET_SYSTEM_STATE() == TX_INITIALIZE_IS_FINISHED)
  {
    TXstatus = tx_mutex_get(&adcCtrlMutex, TX_WAIT_FOREVER);
  }
  else
  {
    TXstatus = TX_SUCCESS;
  }

  if(TXstatus != TX_SUCCESS)
  {
    adc_status = ADCCTRL_NOK;
  }
  else
  {
    adc_status = ADCCTRL_OK;
  }
  /* USER CODE BEGIN ADCCTRL_MutexTake_1 */

  /* USER CODE END ADCCTRL_MutexTake_1 */
  return adc_status;
}

ADCCTRL_Cmd_Status_t ADCCTRL_MutexRelease(void)
{
  UINT TXstatus;
  ADCCTRL_Cmd_Status_t adc_status;
  /* USER CODE BEGIN ADCCTRL_MutexRelease_0 */

  /* USER CODE END ADCCTRL_MutexRelease_0 */
  if(TX_THREAD_GET_SYSTEM_STATE() == TX_INITIALIZE_IS_FINISHED)
  {
    TXstatus = tx_mutex_put(&adcCtrlMutex);
  }
  else
  {
    TXstatus = TX_SUCCESS;
  }

  if(TXstatus != TX_SUCCESS)
  {
    adc_status = ADCCTRL_NOK;
  }
  else
  {
    adc_status = ADCCTRL_OK;
  }
  /* USER CODE BEGIN ADCCTRL_MutexRelease_1 */

  /* USER CODE END ADCCTRL_MutexRelease_1 */
  return adc_status;
}
#endif /* USE_TEMPERATURE_BASED_RADIO_CALIBRATION */

int PKACTRL_MutexTake(void)
{
  int error = 0;
  UINT TXstatus;

  /* Take the mutex */
  TXstatus = tx_mutex_get(&PkaMutex,
                          TX_WAIT_FOREVER);

  if(TXstatus != TX_SUCCESS)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_MutexRelease(void)
{
  int error = 0;
  UINT TXstatus;

  /* Release the mutex */
  TXstatus = tx_mutex_put(&PkaMutex);

  if(TXstatus != TX_SUCCESS)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_TakeSemEndOfOperation(void)
{
  int error = 0;
  UINT TXstatus;

#if (CFG_LPM_LEVEL != 0)
  /* Avoid going in low power during computation */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_SLEEP_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */

  /* Take the semaphore */
  TXstatus = tx_semaphore_get(&PkaEndOfOperationSemaphore,
                              TX_WAIT_FOREVER);

  if(TXstatus != TX_SUCCESS)
  {
    error = -1; /* Error */
  }

  return error;
}

int PKACTRL_ReleaseSemEndOfOperation(void)
{
  int error = 0;
  UINT TXstatus;

  /* Release the semaphore */
  TXstatus = tx_semaphore_put(&PkaEndOfOperationSemaphore);

#if (CFG_LPM_LEVEL != 0)
  /* Restore low power */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_MAX_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */

  if(TXstatus != TX_SUCCESS)
  {
    error = -1; /* Error */
  }

  return error;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
